In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
from sqlalchemy import create_engine,text

In [4]:
df=pd.read_excel(r"C:\Users\Manish\Downloads\zomato_data.xlsx")

In [5]:
df.head()

,RestaurantID,RestaurantName,CountryCode,City,Address,Locality,LocalityVerbose,Longitude,Latitude,Cuisines,...,Datekey_Opening,Unnamed: 20,Cuisines 1,Cuisines 2,Cuisines 3,Cuisines 4,Cuisines 5,Cuisines 6,Cuisines 7,Cuisines 8
0,18435314,Punjabi's Veg Grill,1,New Delhi,"13/288 , 14 Block Gurudwra, Geeta Colony, New ...",Geeta Colony,"Geeta Colony, New Delhi",77.276769,28.650775,North Indian,...,2013_9_21,NaN,North Indian,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,18378015,Tasty Tandoor,1,New Delhi,"726/2, Jheel Khuranja, Geeta Colony, New Delhi",Geeta Colony,"Geeta Colony, New Delhi",77.275052,28.658216,North Indian,...,2016_9_10,NaN,North Indian,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,18424905,Taste of Spice,1,New Delhi,"C-222, Lajpat Nagar 1, New Delhi",Lajpat Nagar 1,"Lajpat Nagar 1, New Delhi",77.241312,28.578311,North Indian,...,2018_9_25,NaN,North Indian,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,18180072,Kolcata Bengali Dhaba,1,New Delhi,"Gali 7, Mahipalpur, New Delhi",Mahipalpur,"Mahipalpur, New Delhi",77.123932,28.543587,North Indian,...,2018_9_6,NaN,North Indian,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,18415377,Sunil Punjabi Dhaba,1,New Delhi,"Main Vasant Kunj Road, Mahipalpur, New Delhi",Mahipalpur,"Mahipalpur, New Delhi",77.129706,28.541369,North Indian,...,2013_9_17,NaN,North Indian,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
df.tail()

,RestaurantID,RestaurantName,CountryCode,City,Address,Locality,LocalityVerbose,Longitude,Latitude,Cuisines,...,Datekey_Opening,Unnamed: 20,Cuisines 1,Cuisines 2,Cuisines 3,Cuisines 4,Cuisines 5,Cuisines 6,Cuisines 7,Cuisines 8
9546,7101042,The Hangar,148,Wellington City,"171-177 Willis Street, Te Aro, Wellington City",Te Aro,"Te Aro, Wellington City",174.773933,-41.290801,Cafe,...,2011_10_3,NaN,Cafe,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9547,7100502,Fidel's,148,Wellington City,"234 Cuba Street, Te Aro, Wellington City",Te Aro,"Te Aro, Wellington City",174.774134,-41.295970,"Cafe, European, Mexican",...,2013_10_1,NaN,Cafe,European,Mexican,NaN,NaN,NaN,NaN,NaN
9548,6900992,Mughal E Azam,215,Birmingham,"Stratford Road, Sparkhill, Birmingham B11 4DA",Sparkhill,"Sparkhill, Birmingham",-1.858529,52.443963,"Pakistani, Indian",...,2017_10_28,NaN,Pakistani,Indian,NaN,NaN,NaN,NaN,NaN,NaN
9549,5800590,The Commons,191,Colombo,"39 A, Flower Road, Cinnamon Gardens, Colombo 07","Cinnamon Gardens, Colombo 07","Cinnamon Gardens, Colombo 07, Colombo",79.858105,6.908536,"Cafe, Sri Lankan, Continental, American",...,2015_10_23,NaN,Cafe,Sri Lankan,Continental,American,NaN,NaN,NaN,NaN
9550,6001980,Timboo Cafe,208,Ankara,"Armada AVM, Kat -1, Eskiôehir Yolu, No 6, Yen...","Armada AVM, Sí_Ûôí_tí_zí_, Yenimahalle","Armada AVM, Sí_Ûôí_tí_zí_, Yenimahalle, Ankara",32.809247,39.913206,Cafe,...,2015_10_4,NaN,Cafe,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9551 entries, 0 to 9550
Data columns (total 29 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   RestaurantID          9551 non-null   int64
 1   RestaurantName        9551 non-null   object
 2   CountryCode           9551 non-null   int64
 3   City                  9551 non-null   object
 4   Address               9551 non-null   object
 5   Locality              9551 non-null   object
 6   LocalityVerbose       9551 non-null   object
 7   Longitude             9551 non-null   float64
 8   Latitude              9551 non-null   float64
 9   Cuisines              9542 non-null   object
 10  Currency              9551 non-null   object
 11  Has_Table_booking     9551 non-null   object
 12  Has_Online_delivery   9551 non-null   object
 13  Is_delivering_now     9551 non-null   object
 14  Switch_to_order_menu  9551 non-null   object
 15  Price_range           9551 non-null   int64
 16  Votes                 9551 non-null   int64
 17  Average_Cost_for_two  9551 non-null   int64
 18  Rating                9551 non-null   float64
 19  Datekey_Opening       9551 non-null   object
 20  Unnamed: 20           0 non-null      float64
 21  Cuisines 1            9542 non-null   object
 22  Cuisines 2            6148 non-null   object
 23  Cuisines 3            2704 non-null   object
 24  Cuisines 4            864 non-null    object
 25  Cuisines 5            280 non-null    object
 26  Cuisines 6            116 non-null    object
 27  Cuisines 7            42 non-null     object
 28  Cuisines 8            14 non-null     object
dtypes: float64(4), int64(5), object(20)
memory usage: 2.1+ MB

In [8]:
df.isnull().sum

<bound method DataFrame.sum of       RestaurantID  RestaurantName  CountryCode   City  Address  Locality  \
0            False           False        False  False    False     False
1            False           False        False  False    False     False
2            False           False        False  False    False     False
3            False           False        False  False    False     False
4            False           False        False  False    False     False
...            ...             ...          ...    ...      ...       ...
9546         False           False        False  False    False     False
9547         False           False        False  False    False     False
9548         False           False        False  False    False     False
9549         False           False        False  False    False     False
9550         False           False        False  False    False     False

      LocalityVerbose  Longitude  Latitude  Cuisines  ...  Datekey_Opening  \
0               False      False     False     False  ...            False
1               False      False     False     False  ...            False
2               False      False     False     False  ...            False
3               False      False     False     False  ...            False
4               False      False     False     False  ...            False
...               ...        ...       ...       ...  ...              ...
9546            False      False     False     False  ...            False
9547            False      False     False     False  ...            False
9548            False      False     False     False  ...            False
9549            False      False     False     False  ...            False
9550            False      False     False     False  ...            False

      Unnamed: 20  Cuisines 1  Cuisines 2  Cuisines 3  Cuisines 4  Cuisines 5  \
0            True       False        True        True        True        True
1            True       False        True        True        True        True
2            True       False        True        True        True        True
3            True       False        True        True        True        True
4            True       False        True        True        True        True
...           ...         ...         ...         ...         ...         ...
9546         True       False        True        True        True        True
9547         True       False       False       False        True        True
9548         True       False       False        True        True        True
9549         True       False       False       False       False        True
9550         True       False        True        True        True        True

      Cuisines 6  Cuisines 7  Cuisines 8
0           True        True        True
1           True        True        True
2           True        True        True
3           True        True        True
4           True        True        True
...          ...         ...         ...
9546        True        True        True
9547        True        True        True
9548        True        True        True
9549        True        True        True
9550        True        True        True

[9551 rows x 29 columns]>

In [9]:
# drop unnamed: 20 column beacuse it is fully empty
df = df.drop(columns=['Unnamed: 20'])

In [10]:
# drop cuisines column beacuse it is duplicate
df=df.drop(columns=["Cuisines"])

In [11]:
# filled columns with unknown using fillna
df[['Cuisines 1','Cuisines 2','Cuisines 3',
  'Cuisines 4','Cuisines 5','Cuisines 6','Cuisines 7',
  'Cuisines 8']]=df[['Cuisines 1','Cuisines 2','Cuisines 3',
                     'Cuisines 4','Cuisines 5','Cuisines 6','Cuisines 7','Cuisines 8']].fillna("unknown")

In [12]:
df.isnull().sum().sum()

np.int64(0)

In [13]:
df["City"]=df["City"].astype('string')
print(df["City"].dtypes)

string

In [14]:
df['Cuisines 1']=df['Cuisines 1'].astype('string')
print(df['Cuisines 1'].dtypes)

string

In [15]:
df["Currency"]=df["Currency"].astype("string")
print(df["Currency"].dtypes)

string

In [16]:
cuisines_coln=["Cuisines 2","Cuisines 3","Cuisines 4","Cuisines 5","Cuisines 6","Cuisines 7","Cuisines 8"]
df[cuisines_coln]=df[cuisines_coln].astype("string")

In [17]:
df["Datekey_Opening"] = df["Datekey_Opening"].str.replace("_", "-", regex=False)
df["Datekey_Opening"] = pd.to_datetime(df["Datekey_Opening"], format="%Y-%m-%d")

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9551 entries, 0 to 9550
Data columns (total 27 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   RestaurantID          9551 non-null   int64
 1   RestaurantName        9551 non-null   object
 2   CountryCode           9551 non-null   int64
 3   City                  9551 non-null   string
 4   Address               9551 non-null   object
 5   Locality              9551 non-null   object
 6   LocalityVerbose       9551 non-null   object
 7   Longitude             9551 non-null   float64
 8   Latitude              9551 non-null   float64
 9   Currency              9551 non-null   string
 10  Has_Table_booking     9551 non-null   object
 11  Has_Online_delivery   9551 non-null   object
 12  Is_delivering_now     9551 non-null   object
 13  Switch_to_order_menu  9551 non-null   object
 14  Price_range           9551 non-null   int64
 15  Votes                 9551 non-null   int64
 16  Average_Cost_for_two  9551 non-null   int64
 17  Rating                9551 non-null   float64
 18  Datekey_Opening       9551 non-null   datetime64[ns]
 19  Cuisines 1            9551 non-null   string
 20  Cuisines 2            9551 non-null   string
 21  Cuisines 3            9551 non-null   string
 22  Cuisines 4            9551 non-null   string
 23  Cuisines 5            9551 non-null   string
 24  Cuisines 6            9551 non-null   string
 25  Cuisines 7            9551 non-null   string
 26  Cuisines 8            9551 non-null   string
dtypes: datetime64[ns](1), float64(3), int64(5), object(8), string(10)
memory usage: 2.0+ MB

In [19]:
engine=create_engine("mysql+pymysql://pandas:pandas@localhost:3306/pandasdb",
                     echo=True)
with engine.connect() as conn:
    result=conn.execute(text("select database();"))
    print("connect to:",result.fetchone())

2026-02-15 00:59:45,163 INFO sqlalchemy.engine.Engine SELECT DATABASE()
2026-02-15 00:59:45,164 INFO sqlalchemy.engine.Engine [raw sql] {}
2026-02-15 00:59:45,167 INFO sqlalchemy.engine.Engine SELECT @@sql_mode
2026-02-15 00:59:45,168 INFO sqlalchemy.engine.Engine [raw sql] {}
2026-02-15 00:59:45,170 INFO sqlalchemy.engine.Engine SELECT @@lower_case_table_names
2026-02-15 00:59:45,171 INFO sqlalchemy.engine.Engine [raw sql] {}
2026-02-15 00:59:45,175 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2026-02-15 00:59:45,176 INFO sqlalchemy.engine.Engine select database();
2026-02-15 00:59:45,177 INFO sqlalchemy.engine.Engine [generated in 0.00250s] {}
connect to: ('pandasdb',)
2026-02-15 00:59:45,180 INFO sqlalchemy.engine.Engine ROLLBACK

In [20]:
pd.read_sql_query("show databases;",engine)

2026-02-15 00:59:45,495 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2026-02-15 00:59:45,496 INFO sqlalchemy.engine.Engine show databases;
2026-02-15 00:59:45,497 INFO sqlalchemy.engine.Engine [raw sql] {}
2026-02-15 00:59:45,510 INFO sqlalchemy.engine.Engine ROLLBACK

             Database
0  information_schema
1            pandasdb
2  performance_schema

In [21]:
df.to_sql("Zomato_analysis",con=engine,if_exists="replace",index=False)

2026-02-15 00:59:46,426 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2026-02-15 00:59:46,437 INFO sqlalchemy.engine.Engine DESCRIBE `pandasdb`.`Zomato_analysis`
2026-02-15 00:59:46,438 INFO sqlalchemy.engine.Engine [raw sql] {}
2026-02-15 00:59:46,447 INFO sqlalchemy.engine.Engine
CREATE TABLE `Zomato_analysis` (
	`RestaurantID` BIGINT,
	`RestaurantName` TEXT,
	`CountryCode` BIGINT,
	`City` TEXT,
	`Address` TEXT,
	`Locality` TEXT,
	`LocalityVerbose` TEXT,
	`Longitude` FLOAT(53),
	`Latitude` FLOAT(53),
	`Currency` TEXT,
	`Has_Table_booking` TEXT,
	`Has_Online_delivery` TEXT,
	`Is_delivering_now` TEXT,
	`Switch_to_order_menu` TEXT,
	`Price_range` BIGINT,
	`Votes` BIGINT,
	`Average_Cost_for_two` BIGINT,
	`Rating` FLOAT(53),
	`Datekey_Opening` DATETIME,
	`Cuisines 1` TEXT,
	`Cuisines 2` TEXT,
	`Cuisines 3` TEXT,
	`Cuisines 4` TEXT,
	`Cuisines 5` TEXT,
	`Cuisines 6` TEXT,
	`Cuisines 7` TEXT,
	`Cuisines 8` TEXT
)


2026-02-15 00:59:46,449 INFO sqlalchemy.engine.Engine [no key 0.00168s] {}
2026-02-15 00:59:46,768 INFO sqlalchemy.engine.Engine INSERT INTO `Zomato_analysis` (`RestaurantID`, `RestaurantName`, `CountryCode`, `City`, `Address`, `Locality`, `LocalityVerbose`, `Longitude`, `Latitude`, `Currency`, `Has_Table_booking`, `Has_Online_delivery`, `Is_delivering_now`, `Switch_to_order_menu`, `Price_range`, `Votes`, `Average_Cost_for_two`, `Rating`, `Datekey_Opening`, `Cuisines 1`, `Cuisines 2`, `Cuisines 3`, `Cuisines 4`, `Cuisines 5`, `Cuisines 6`, `Cuisines 7`, `Cuisines 8`) VALUES (%(RestaurantID)s, %(RestaurantName)s, %(CountryCode)s, %(City)s, %(Address)s, %(Locality)s, %(LocalityVerbose)s, %(Longitude)s, %(Latitude)s, %(Currency)s, %(Has_Table_booking)s, %(Has_Online_delivery)s, %(Is_delivering_now)s, %(Switch_to_order_menu)s, %(Price_range)s, %(Votes)s, %(Average_Cost_for_two)s, %(Rating)s, %(Datekey_Opening)s, %(Cuisines_1)s, %(Cuisines_2)s, %(Cuisines_3)s, %(Cuisines_4)s, %(Cuisines_5)s, %(Cuisines_6)s, %(Cuisines_7)s, %(Cuisines_8)s)
2026-02-15 00:59:46,769 INFO sqlalchemy.engine.Engine [generated in 0.21258s] [{'RestaurantID': 18435314, 'RestaurantName': "Punjabi's Veg Grill", 'CountryCode': 1, 'City': 'New Delhi', 'Address': '13/288 , 14 Block Gurudwra, Geeta Colony, New Delhi', 'Locality': 'Geeta Colony', 'LocalityVerbose': 'Geeta Colony, New Delhi', 'Longitude': 77.2767689, 'Latitude': 28.6507753, 'Currency': 'Indian Rupees(Rs.)', 'Has_Table_booking': 'No', 'Has_Online_delivery': 'No', 'Is_delivering_now': 'No', 'Switch_to_order_menu': 'No', 'Price_range': 1, 'Votes': 0, 'Average_Cost_for_two': 300, 'Rating': 1.0, 'Datekey_Opening': datetime.datetime(2013, 9, 21, 0, 0), 'Cuisines_1': 'North Indian', 'Cuisines_2': 'unknown', 'Cuisines_3': 'unknown', 'Cuisines_4': 'unknown', 'Cuisines_5': 'unknown', 'Cuisines_6': 'unknown', 'Cuisines_7': 'unknown', 'Cuisines_8': 'unknown'}, {'RestaurantID': 18378015, 'RestaurantName': 'Tasty Tandoor', 'CountryCode': 1, 'City': 'New Delhi', 'Address': '726/2, Jheel Khuranja, Geeta Colony, New Delhi', 'Locality': 'Geeta Colony', 'LocalityVerbose': 'Geeta Colony, New Delhi', 'Longitude': 77.27505159, 'Latitude': 28.65821556, 'Currency': 'Indian Rupees(Rs.)', 'Has_Table_booking': 'No', 'Has_Online_delivery': 'No', 'Is_delivering_now': 'No', 'Switch_to_order_menu': 'No', 'Price_range': 1, 'Votes': 0, 'Average_Cost_for_two': 200, 'Rating': 1.0, 'Datekey_Opening': datetime.datetime(2016, 9, 10, 0, 0), 'Cuisines_1': 'North Indian', 'Cuisines_2': 'unknown', 'Cuisines_3': 'unknown', 'Cuisines_4': 'unknown', 'Cuisines_5': 'unknown', 'Cuisines_6': 'unknown', 'Cuisines_7': 'unknown', 'Cuisines_8': 'unknown'}, {'RestaurantID': 18424905, 'RestaurantName': 'Taste of Spice', 'CountryCode': 1, 'City': 'New Delhi', 'Address': 'C-222, Lajpat Nagar 1, New Delhi', 'Locality': 'Lajpat Nagar 1', 'LocalityVerbose': 'Lajpat Nagar 1, New Delhi', 'Longitude': 77.2413122, 'Latitude': 28.5783107, 'Currency': 'Indian Rupees(Rs.)', 'Has_Table_booking': 'No', 'Has_Online_delivery': 'Yes', 'Is_delivering_now': 'No', 'Switch_to_order_menu': 'No', 'Price_range': 1, 'Votes': 0, 'Average_Cost_for_two': 400, 'Rating': 1.0, 'Datekey_Opening': datetime.datetime(2018, 9, 25, 0, 0), 'Cuisines_1': 'North Indian', 'Cuisines_2': 'unknown', 'Cuisines_3': 'unknown', 'Cuisines_4': 'unknown', 'Cuisines_5': 'unknown', 'Cuisines_6': 'unknown', 'Cuisines_7': 'unknown', 'Cuisines_8': 'unknown'}, {'RestaurantID': 18180072, 'RestaurantName': 'Kolcata Bengali Dhaba', 'CountryCode': 1, 'City': 'New Delhi', 'Address': 'Gali 7, Mahipalpur, New Delhi', 'Locality': 'Mahipalpur', 'LocalityVerbose': 'Mahipalpur, New Delhi', 'Longitude': 77.1239323, 'Latitude': 28.5435869, 'Currency': 'Indian Rupees(Rs.)', 'Has_Table_booking': 'No', 'Has_Online_delivery': 'No', 'Is_delivering_now': 'No', 'Switch_to_order_menu': 'No', 'Price_range': 1, 'Votes': 0, 'Average_Cost_for_two': 100, 'Rating': 1.0, 'Datekey_Opening': datetime.datetime(2018, 9, 6, 0, 0), 'Cuisines_1': 'North Indian', 'Cuisines_2': 'unknown', 'Cuisines_3': 'unknown', 'Cuisines_4': 'unknown', 'Cuisines_5': 'unknown', 'Cuisines_6': 'unknown', 'Cuisines_7': 'unknown', 'Cuisines_8': 'unknown'}, {'RestaurantID': 18415377, 'RestaurantName': 'Sunil Punjabi Dhaba', 'CountryCode': 1, 'City': 'New Delhi', 'Address': 'Main Vasant Kunj Road, Mahipalpur, New Delhi', 'Locality': 'Mahipalpur', 'LocalityVerbose': 'Mahipalpur, New Delhi', 'Longitude': 77.1297061, 'Latitude': 28.5413686, 'Currency': 'Indian Rupees(Rs.)', 'Has_Table_booking': 'No', 'Has_Online_delivery': 'No', 'Is_delivering_now': 'No', 'Switch_to_order_menu': 'No', 'Price_range': 1, 'Votes': 0, 'Average_Cost_for_two': 150, 'Rating': 1.0, 'Datekey_Opening': datetime.datetime(2013, 9, 17, 0, 0), 'Cuisines_1': 'North Indian', 'Cuisines_2': 'unknown', 'Cuisines_3': 'unknown', 'Cuisines_4': 'unknown', 'Cuisines_5': 'unknown', 'Cuisines_6': 'unknown', 'Cuisines_7': 'unknown', 'Cuisines_8': 'unknown'}, {'RestaurantID': 18421485, 'RestaurantName': 'Bikaner Restaurant', 'CountryCode': 1, 'City': 'New Delhi', 'Address': 'Shop 264, Near Hakikat Nagar, Mukherjee Nagar, New Delhi', 'Locality': 'Mukherjee Nagar', 'LocalityVerbose': 'Mukherjee Nagar, New Delhi', 'Longitude': 77.2081351, 'Latitude': 28.699566, 'Currency': 'Indian Rupees(Rs.)', 'Has_Table_booking': 'No', 'Has_Online_delivery': 'No', 'Is_delivering_now': 'No', 'Switch_to_order_menu': 'No', 'Price_range': 1, 'Votes': 0, 'Average_Cost_for_two': 100, 'Rating': 1.0, 'Datekey_Opening': datetime.datetime(2018, 9, 3, 0, 0), 'Cuisines_1': 'North Indian', 'Cuisines_2': 'unknown', 'Cuisines_3': 'unknown', 'Cuisines_4': 'unknown', 'Cuisines_5': 'unknown', 'Cuisines_6': 'unknown', 'Cuisines_7': 'unknown', 'Cuisines_8': 'unknown'}, {'RestaurantID': 312413, 'RestaurantName': 'Just In', 'CountryCode': 1, 'City': 'New Delhi', 'Address': 'G-103, Vardhaman Mall, Mukherjee Nagar, New Delhi', 'Locality': 'Mukherjee Nagar', 'LocalityVerbose': 'Mukherjee Nagar, New Delhi', 'Longitude': 77.2190942, 'Latitude': 28.7094798, 'Currency': 'Indian Rupees(Rs.)', 'Has_Table_booking': 'No', 'Has_Online_delivery': 'No', 'Is_delivering_now': 'No', 'Switch_to_order_menu': 'No', 'Price_range': 1, 'Votes': 0, 'Average_Cost_for_two': 200, 'Rating': 1.0, 'Datekey_Opening': datetime.datetime(2011, 9, 16, 0, 0), 'Cuisines_1': 'North Indian', 'Cuisines_2': 'unknown', 'Cuisines_3': 'unknown', 'Cuisines_4': 'unknown', 'Cuisines_5': 'unknown', 'Cuisines_6': 'unknown', 'Cuisines_7': 'unknown', 'Cuisines_8': 'unknown'}, {'RestaurantID': 303497, 'RestaurantName': 'Shri Shyam Ji Shudh Shakahari Bhojnalaya', 'CountryCode': 1, 'City': 'New Delhi', 'Address': 'Khaira Mod, Najafgarh, New Delhi', 'Locality': 'Najafgarh', 'LocalityVerbose': 'Najafgarh, New Delhi', 'Longitude': 76.9748922, 'Latitude': 28.6112536, 'Currency': 'Indian Rupees(Rs.)', 'Has_Table_booking': 'No', 'Has_Online_delivery': 'No', 'Is_delivering_now': 'No', 'Switch_to_order_menu': 'No', 'Price_range': 1, 'Votes': 0, 'Average_Cost_for_two': 150, 'Rating': 1.0, 'Datekey_Opening': datetime.datetime(2014, 9, 21, 0, 0), 'Cuisines_1': 'North Indian', 'Cuisines_2': 'unknown', 'Cuisines_3': 'unknown', 'Cuisines_4': 'unknown', 'Cuisines_5': 'unknown', 'Cuisines_6': 'unknown', 'Cuisines_7': 'unknown', 'Cuisines_8': 'unknown'}  ... displaying 10 of 9551 total bound parameter sets ...  {'RestaurantID': 5800590, 'RestaurantName': 'The Commons', 'CountryCode': 191, 'City': 'Colombo', 'Address': '39 A, Flower Road, Cinnamon Gardens, Colombo 07', 'Locality': 'Cinnamon Gardens, Colombo 07', 'LocalityVerbose': 'Cinnamon Gardens, Colombo 07, Colombo', 'Longitude': 79.8581047, 'Latitude': 6.908536272, 'Currency': 'Sri Lankan Rupee(LKR)', 'Has_Table_booking': 'No', 'Has_Online_delivery': 'No', 'Is_delivering_now': 'No', 'Switch_to_order_menu': 'No', 'Price_range': 3, 'Votes': 209, 'Average_Cost_for_two': 2500, 'Rating': 4.0, 'Datekey_Opening': datetime.datetime(2015, 10, 23, 0, 0), 'Cuisines_1': 'Cafe', 'Cuisines_2': ' Sri Lankan', 'Cuisines_3': ' Continental', 'Cuisines_4': ' American', 'Cuisines_5': 'unknown', 'Cuisines_6': 'unknown', 'Cuisines_7': 'unknown', 'Cuisines_8': 'unknown'}, {'RestaurantID': 6001980, 'RestaurantName': 'Timboo Cafe', 'CountryCode': 208, 'City': 'Ankara', 'Address': 'Armada AVM, Kat -1, Eski\x81ôehir Yolu, No 6, Yenimahalle, Ankara', 'Locality': 'Armada AVM, Sí_Ûôí_tí_zí_, Yenimahalle', 'LocalityVerbose': 'Armada AVM, Sí_Ûôí_tí_zí_, Yenimahalle, Ankara', 'Longitude': 32.80924722, 'Latitude': 39.91320556, 'Currency': 'Turkish Lira(TL)', 'Has_Table_booking': 'No', 'Has_Online_delivery': 'No', 'Is_delivering_now': 'No', 'Switch_to_order_menu': 'No', 'Price_range': 3, 'Votes': 134, 'Average_Cost_for_two': 70, 'Rating': 4.2, 'Datekey_Opening': datetime.datetime(2015, 10, 4, 0, 0), 'Cuisines_1': 'Cafe', 'Cuisines_2': 'unknown', 'Cuisines_3': 'unknown', 'Cuisines_4': 'unknown', 'Cuisines_5': 'unknown', 'Cuisines_6': 'unknown', 'Cuisines_7': 'unknown', 'Cuisines_8': 'unknown'}]
2026-02-15 00:59:47,690 INFO sqlalchemy.engine.Engine SHOW FULL TABLES FROM `pandasdb`
2026-02-15 00:59:47,691 INFO sqlalchemy.engine.Engine [raw sql] {}
2026-02-15 00:59:47,696 INFO sqlalchemy.engine.Engine COMMIT

C:\Users\Manish\AppData\Local\Temp\ipykernel_24808\3361465383.py:1: UserWarning: The provided table name 'Zomato_analysis' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df.to_sql("Zomato_analysis",con=engine,if_exists="replace",index=False)

9551

In [22]:
pd.read_sql_query("show tables",engine)

2026-02-15 00:59:52,893 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2026-02-15 00:59:52,894 INFO sqlalchemy.engine.Engine show tables
2026-02-15 00:59:52,895 INFO sqlalchemy.engine.Engine [raw sql] {}
2026-02-15 00:59:52,899 INFO sqlalchemy.engine.Engine ROLLBACK

           Tables_in_pandasdb
0                    customer
1  millionaire_migration_2025
2  millioniare_migration_2025
3                    products
4    students_perfomance_data
5   students_performance_data
6             zomato_analysis